mikewang01/GOWATCH/ClingGo_NRF52/project/tasks/ble_peripheral_task.c
//        gap_mgr = GapMgr_get_instance();
//        gap_mgr->register_task(OS_GET_CURRENT_TASK());
//        gap_mgr->init_adv_data(gap_mgr);
//        gap_mgr->start_adv(gap_mgr);
//        size_t dev_id_length;
//        extern uint8_t *SYSTEM_set_dev_id(void);
//        uint8_t *t = (uint8_t*)SYSTEM_set_dev_id();
//        gap_mgr->get_dev_id_str(gap_mgr, t, &dev_id_length);

//        // Initialize application
//        btle_fsm_init();
		uint32_t err_code;
    bool     erase_bonds;

    UNUSED_PARAMETER(params);
		

				
    ble_stack_init();
    peer_manager_init(erase_bonds);
    //gap_params_init();
   // advertising_init();
    services_init();
    sensor_simulator_init();
    //conn_params_init();

		cling_service_init(NULL, task_handles);
		
		CLASS(GapMgr)* gap_mgr = GapMgr_get_instance();
    gap_mgr->register_task(OS_GET_CURRENT_TASK());
		gap_mgr->set_dev_name(gap_mgr, "RBAND");
		gap_mgr->switch_2_fast_conn_mode(gap_mgr);
    gap_mgr->init_adv_data(gap_mgr);
    gap_mgr->start_adv(gap_mgr);
    //APP_ERROR_CHECK(err_code);
        for (;;) {
         OS_BASE_TYPE ret  __attribute__((unused));
         uint32_t notif;
        /* Wait for event from SoftDevice */
//        while (pdFALSE == xSemaphoreTake(m_ble_event_ready, portMAX_DELAY))
//        {
//            // Just wait again in the case when INCLUDE_vTaskSuspend is not enabled
//        }
				/*
				 * Wait on any of the notification bits, then clear them all
				 */
        ret = OS_TASK_NOTIFY_WAIT(0, OS_TASK_NOTIFY_ALL_BITS, &notif,
                        OS_TASK_NOTIFY_FOREVER);
				/* Blocks forever waiting for task notification. The return value must be OS_OK */
				//OS_ASSERT(ret == OS_OK);
				if(notif & BLE_APP_NOTIFY_SOFT_DEVICE_MASK){
        // This function gets events from the SoftDevice and processes them by calling the function
        // registered by softdevice_ble_evt_handler_set during stack initialization.
        // In this code ble_evt_dispatch would be called for every event found.
        intern_softdevice_events_execute();				
				}



                if (notif & BLE_APP_NOTIFY_FSM_MASK) {
                        btle_fsm_process();
                }

                if(notif & BLE_APP_NOTIFY_CLING_STRAT_ADV_REQUEST_MASK){
                        gap_mgr->start_adv(gap_mgr);
                }

                if(notif & BLE_APP_NOTIFY_CLING_ADV_SWITCH_SPEED_REQUEST_MASK){
                        gap_mgr->adv_freq_swicth_process(gap_mgr);
                }
//                extern int clingpay_mac_fsm();
//                if (notif & BLE_APP_NOTIFY_FSM_MASK) {
//                        clingpay_mac_fsm();
//                }
//                extern int clingpay_cmd_fsm();
//                if (notif & BLE_APP_NOTIFY_CLING_PAY_CMD_MASK) {
//                        clingpay_cmd_fsm();
//                }
//                int get_balance_fsm();
//                if (notif & BLE_APP_NOTIFY_CLING_PAY_BALANCE_MASK) {
//                        get_balance_fsm();
//                }
//                extern int CLNGPAY_balance_callback(uint32_t balance);
//                if (notif & BLE_APP_NOTIFY_CLING_PAY_BALANCE_SYNC_MASK) {
//                        if (OS_TIMER_IS_ACTIVE(balance_sync_timer)) {
//                                OS_TIMER_STOP(balance_sync_timer, 0);
//                        }
//                        OS_TIMER_START(balance_sync_timer, 0);
//                }

//                if(notif & BLE_APP_NOTIFY_CLING_PAY_BALANCE_SYNC_TIMEOUT_MASK){
//                        if (OS_TIMER_IS_ACTIVE(balance_sync_timer)) {
//                                OS_TIMER_STOP(balance_sync_timer, 0);
//                        }
//                        extern int get_balance(int(*cb)(uint32_t balance));
//                        get_balance(CLNGPAY_balance_callback);
//                }


//#if CFG_CTS
//                if (notif & CTS_SET_TIME_NOTIF) {
//                        cts_notify_time_all(cts, &cts_time);
//                }
//#endif
        }
}
